app/Http/Controllers/CourseController.php

    public function index()
    {
        $data = Course::with('subjects')->latest()->paginate(5);
        // dump($data);
        return view('modules.course.index', compact('data'))->with('i', (request()->input('page', 1) - 1) * 5);
---
select * from `courses` order by `created_at` desc limit 5 offset 0
select * from `subjects` where `subjects`.`course_id` in (1, 2, 3, 4)
select count(*) as aggregate from `courses`
select `id` from `courses`