app/Http/Controllers/ExamController.php

select * from `courses` where `courses`.`id` in (1, 2, 3)
select * from `exams` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `exams`
---
    public function index()
    {
        $data = Exam::with('course','invigilator','examiner')->latest()->paginate(5);

select * from `staff` where `staff`.`id` in (1)
---
    public function create()
    {
        $courses = Course::select('id','title')->get();
        $staffs = Staff::with('user')->get();