app/Http/Controllers/ExamAttendanceController.php

select `id`, `title` from `courses`
select * from `students` where exists (select * from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `students`.`id` = `course_student`.`student_id` and `id` is null)
select * from `users` where `users`.`id` in (3)
select `courses`.*, `course_student`.`student_id` as `pivot_student_id`, `course_student`.`course_id` as `pivot_course_id` from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`student_id` in (1)
---
    public function index(Request $request)
    {
        $courses = Course::select('id', 'title')->get();

        if ($request->ajax()) {

            if ($request->search['value'] != "") {

                $keyword = $request->search['value'];
                $students = Student::with('user', 'courses')
                    ->whereHas('courses', function ($query) use ($request) {
                        $query->where('id', '=', $request->course_id);
                    })
                    ->whereHas('user', function ($q) use ($keyword) {
                        $q->where('name', 'like', "%$keyword%");
                    })->get();
            } else {
                $students = Student::with('user', 'courses')
                    ->whereHas('courses', function ($query) use ($request) {
                        $query->where('id', '=', $request->course_id);
                    })->get();

select `title`, `id` from `exams` where `course_id` = '1'
---
    public function fetchExams(Request $request)
    {

        $data['exams'] = Exam::where("course_id", $request->course_id)->get(["title", "id"]);

select * from `students` where `id` = '1' limit 1
insert into `exam_student` (`exam_id`, `student_id`) values ('4', 1)
---
    public function massPresent(Request $request)
    {
        $students = $request->ids;
        foreach ($students as $student) {
            $student = Student::where('id', '=', $student)->first();
            $student->exams()->attach($request->exam_id);

select * from `students` where `id` = '2' limit 1
delete from `exam_student` where `exam_student`.`student_id` = 2 and `exam_student`.`exam_id` in ('3')
---
    public function massUnPresent(Request $request)
    {
        $students = $request->ids;
        foreach ($students as $student) {
            $student = Student::where('id', '=', $student)->first();
            $student->exams()->detach($request->exam_id);