app/Http/Controllers/ExamAttendanceController.php

select `exams`.*, `exam_student`.`student_id` as `pivot_student_id`, `exam_student`.`exam_id` as `pivot_exam_id`, `exam_student`.`result` as `pivot_result` from `exams` inner join `exam_student` on `exams`.`id` = `exam_student`.`exam_id` where `exam_student`.`student_id` = 4
---

                })
                ->addColumn('writtens_exam', function (Student $student) {
                    return $student->exams->map(function($exam){
                        return $exam -> id;
                    });