app/Http/Controllers/PermissionController.php

select count(*) as aggregate from `permissions`
select count(*) as aggregate from `permissions` where `name` like '%%'
select `permissions`.* from `permissions` where `permissions`.`name` like '%%' order by `id` asc limit 10 offset 0
---
    public function getPermissions(Request $request)
    {
        ## Read value
        $draw = $request->get('draw');
        $start = $request->get("start");
        $rowperpage = $request->get("length"); // Rows display per page

        $columnIndex_arr = $request->get('order');
        $columnName_arr = $request->get('columns');
        $order_arr = $request->get('order');
        $search_arr = $request->get('search');

        $columnIndex = $columnIndex_arr[0]['column']; // Column index
        $columnName = $columnName_arr[$columnIndex]['data']; // Column name
        $columnSortOrder = $order_arr[0]['dir']; // asc or desc
        $searchValue = $search_arr['value']; // Search value

        // Total records
        $totalRecords = Permission::select('count(*) as allcount')->count();
        $totalRecordswithFilter = Permission::select('count(*) as allcount')->where('name', 'like', '%' .$searchValue . '%')->count();

        // Fetch records
        $records = Permission::orderBy($columnName,$columnSortOrder)
                ->where('permissions.name', 'like', '%' .$searchValue . '%')
                ->select('permissions.*')
                ->skip($start)
                ->take($rowperpage)
                ->get();

delete from `permissions` where `id` = 11
---
    public function destroy(Permission $permission)
    {
        $permission->delete();