app/Http/Controllers/ResultController.php

    public function index(Request $request)
    {
        $exams = Exam::select('id', 'title')->get();
---
select `id`, `title` from `exams`

    public function update(Request $request)
    {
        $exams = Exam::select('id', 'title')->get();
        $student = Student::where('id', '=', $request->student_id)->first();

        $student->exams()->updateExistingPivot($request->exam_id, [
            'result' => $request->result,
        ]);
---
select `id`, `title` from `exams`
select * from `exam_student` where `exam_student`.`student_id` = 1
select * from `students` where `id` = '1' limit 1
update `exam_student` set `result` = '34' where `exam_student`.`student_id` = 1 and `exam_id` in ('4')