app/Http/Controllers/RoleController.php

    public function index(Request $request)
    {
        $roles = Role::orderBy('id','DESC')->paginate(5);
---
select * from `roles` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `roles`