app/Http/Controllers/StudentController.php

select * from `users` where `users`.`id` in (13, 14, 16, 17, 18, 19, 20, 21, 22, 23)
select count(*) as aggregate from `students`
select * from `students` order by `created_at` desc limit 10 offset 0
---
    public function index()
    {
        $data = Student::with('user')->latest()->paginate(5);
        return view('modules.student.index', compact('data'))->with('i', (request()->input('page', 1) - 1) * 5);