app/Http/Controllers/SubjectController.php

    public function index()
    {
        $data = Subject::latest()->paginate(5);
        return view('modules.subject.index', compact('data'))->with('i', (request()->input('page', 1) - 1) * 5);
---
select * from `subjects` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `subjects`