app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        $data = User::orderBy('id','DESC')->paginate(5);
        return view('modules.user.index',compact('data'))->with('i', ($request->input('page', 1) - 1) * 5);
---
select * from `users` where `users`.`id` in (19, 20, 21, 22, 23)